v13/burningCylinder2D/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

Uinlet          5;
internalField   uniform ($Uinlet 0 0);

boundaryField
{
    #include "${FOAM_CASE}/0/bcParams"

    inlet
    {
        type            fixedValue;
        value           $internalField;
        
        // type            waveTransmissive;
        // fieldInf        (0 0 0);
        // $waveTransmissiveParams;
    }

    outlet
    {
        // type            zeroGradient;
        
        type            waveTransmissive;
        fieldInf        ($Uinlet 0 0);
        $waveTransmissiveParams;
    }

    wallsY
    {
        // type            noSlip;
        // type            slip;

        type            waveTransmissive;
        fieldInf        ($Uinlet 0 0);
        $waveTransmissiveParams;
    }

    cylinder
    {
        type            noSlip;
    }

    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
