v13/burningCylinder2D/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  1e5; //1.33e4;

boundaryField
{
    #include "${FOAM_CASE}/0/bcParams"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        // type            fixedValue;
        // value           $internalField;

        type            waveTransmissive;
        fieldInf        1e5;
        $waveTransmissiveParams;
    }

    wallsY
    {
        // type            zeroGradient;

        type            waveTransmissive;
        fieldInf        1e5;
        $waveTransmissiveParams;
    }

    cylinder
    {
        type            zeroGradient;
    }

    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
